Repository: Marcell07x/PT_app
Catalog: lib/l10n/app_*.arb
Languages: hu

# form
source: Here is the form
hu: kérdőív

# wallPush
source: Wall Push Ups
hu: Fal Fekvőtámasz

# tablePush
source: Table Push Ups
hu: Asztal Fekvőtámasz

# kneePush
source: Knee Push Ups
hu: Térdelő Fekvőtámasz

# pushUp
source: Pushups
hu: Fekvőtámasz

# declinePush
source: Decline Push Ups
hu: Feltett Lábas Fekvőtámasz

# clapPush
source: Explosive Clap Push Ups
hu: Tapsoló Fekvőtámasz

# archerPush
source: Archer Push Ups
hu: Íjász Fekvőtámasz

# dipPush
source: Dips
hu: Tolóckodás

# bagPull
source: One Hand Bag Rows
hu: Táskás/Súlyzós Evezés

# bwPull
source: Bodyweight Rows
hu: Alacsony Rudas Evezés

# pullup
source: Pullups
hu: Húzóckodás

# squat1
source: Assisted Squats
hu: Kapaszkodással Guggolás

# lunge1
source: Assisted Lunges
hu: Kapaszkodással Kitörés

# squat2
source: Squats
hu: Guggolás

# lunge2
source: Lunges
hu: Kitörés

# squat3
source: Backpack Squats
hu: Táskás Guggolás

# lunge3
source: Step Ups
hu: Fellépések

# squat4
source: Jumping Squats
hu: Guggolásból Ugrás

# lunge4
source: Elevated Lunges
hu: Bolgár Guggolás

# squat5
source: Archer Squats
hu: Oldalas Guggolás

# lunge5
source: Half Leg Lunges
hu: Féllábas kitörés

# core1
source: Situps
hu: Hasprés

# core2
source: Supermans
hu: Superman

source: Workout
hu: Edzés

# reps
source: Repetitions
hu: Ismétlés

source: Next
hu: Következő

# goback
source: Back
hu: Előző

source: Start Workout
hu: Edzés Kezdése

source: Question
hu: Kérdés

# nextq
source: Next question
hu: Következő kérdés

source: Finish
hu: Befejezés

# mainGoal
source: What's your main goal?
hu: Mi a fő célod?

source: Weight Loss
hu: Fogyás

# muscleBuild
source: Building Muscle
hu: Izomosodás

# maxKneePush
source: How many knee pushups can you do?
hu: Hány térdelő fekvőtámaszt tudsz?

# maxSquats
source: How many squats can you do?
hu: Hány guggolást tudsz?

# prevExp1
source: Did you use to play sports regularly?
hu: Sportoltál-e régebben rendszeresen?

source: Yes
hu: Igen

source: No
hu: Nem

# prevExp2
source: Have you tried to work out before?
hu: Próbáltál már elkezdeni edzeni?

# motivation
source: How much are you motivated to work out?
hu: Mennyire van kedved edzeni?

source: Not at all
hu: Nincsen

# somewhat
source: I'm somewhat motivated
hu: Valamennyire talán

# motivated
source: I'm motivated
hu: Motivált vagyok

# age
source: What is your age group?
hu: Mi a korosztályod?

# congrat
source: Congratulations!
hu: Gratulálok!

# congratMessage
source: Workout complete!
hu: Megcsináltad az edzésed!
